In [2]:
import sqlite3
import pandas as pd

C:\Users\Dude\anaconda3\lib\site-packages\pandas\core\computation\expressions.py:20: UserWarning: Pandas requires version '2.7.3' or newer of 'numexpr' (version '2.7.1' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED

In [5]:
# we create a database to load data from existing csv file
conn=sqlite3.connect('STAFF.db')
table_name="INSTRUCTOR" # table name
attribute_list=['ID','FNAME','LNAME','CITY','CCODE'] # list of columns
file_path = 'INSTRUCTOR.csv'
df = pd.read_csv(file_path, names = attribute_list) # change the csv file to dataframe
df.to_sql(table_name, conn, if_exists = 'replace', index =False) # now we load the dataframe into table format
print('Table is ready')

Table is ready

In [9]:
# Query the table
query_statement=f"SELECT * FROM {table_name}"
query_output=pd.read_sql(query_statement,conn)
#print(query_statement)
print("Instructors List:\n\n")
print(query_output)

Instructors List:


    ID    FNAME      LNAME      CITY CCODE
0    1      Rav      Ahuja   TORONTO    CA
1    2     Raul      Chong   Markham    CA
2    3     Hima  Vasudevan   Chicago    US
3    4     John     Thomas  Illinois    US
4    5    Alice      James  Illinois    US
5    6    Steve      Wells  Illinois    US
6    7  Santosh      Kumar  Illinois    US
7    8    Ahmed    Hussain  Illinois    US
8    9    Nancy      Allen  Illinois    US
9   10     Mary     Thomas  Illinois    US
10  11  Bharath      Gupta  Illinois    US
11  12   Andrea      Jones  Illinois    US
12  13      Ann      Jacob  Illinois    US
13  14     Amit      Kumar  NewDelhi    IN

In [10]:
#Listing only FNAME from the table
query_statement = f"SELECT FNAME FROM {table_name}"
query_output = pd.read_sql(query_statement, conn)
print("List of First Names:\n")
print(query_output)

List of First Names:

      FNAME
0       Rav
1      Raul
2      Hima
3      John
4     Alice
5     Steve
6   Santosh
7     Ahmed
8     Nancy
9      Mary
10  Bharath
11   Andrea
12      Ann
13     Amit

In [13]:
# Viewing the total number of entries in the table
query_statement = f"SELECT COUNT(*) FROM {table_name}"
query_output = pd.read_sql(query_statement, conn)
print('Number of Records in the Table\n')
print(query_output)

Number of Records in the Table

   COUNT(*)
0        14

In [14]:
# Now add another entry to the table
data_dict = {'ID' : [100],
            'FNAME' : ['John'],
            'LNAME' : ['Doe'],
            'CITY' : ['Paris'],
            'CCODE' : ['FR']}
data_append = pd.DataFrame(data_dict)

In [15]:
# Now append the created dictionary to the table
data_append.to_sql(table_name, conn, if_exists = 'append', index =False)
print('Data appended successfully')

Data appended successfully

In [16]:
# Viewing the total number of entries in the table
query_statement = f"SELECT COUNT(*) FROM {table_name}"
query_output = pd.read_sql(query_statement, conn)
print('Number of Records in the Table\n')
print(query_output)

Number of Records in the Table

   COUNT(*)
0        15

In [17]:
# Query the table
query_statement=f"SELECT * FROM {table_name}"
query_output=pd.read_sql(query_statement,conn)
#print(query_statement)
print("Instructors List:\n\n")
print(query_output)

Instructors List:


     ID    FNAME      LNAME      CITY CCODE
0     1      Rav      Ahuja   TORONTO    CA
1     2     Raul      Chong   Markham    CA
2     3     Hima  Vasudevan   Chicago    US
3     4     John     Thomas  Illinois    US
4     5    Alice      James  Illinois    US
5     6    Steve      Wells  Illinois    US
6     7  Santosh      Kumar  Illinois    US
7     8    Ahmed    Hussain  Illinois    US
8     9    Nancy      Allen  Illinois    US
9    10     Mary     Thomas  Illinois    US
10   11  Bharath      Gupta  Illinois    US
11   12   Andrea      Jones  Illinois    US
12   13      Ann      Jacob  Illinois    US
13   14     Amit      Kumar  NewDelhi    IN
14  100     John        Doe     Paris    FR

In [21]:
# Now add another entry to the table
data_dict = {'ID' : [21],
            'FNAME' : ['Mosisa'],
            'LNAME' : ['Olana'],
            'CITY' : ['New York'],
            'CCODE' : ['NY']}
data_append = pd.DataFrame(data_dict)

In [22]:
# Now append the created dictionary to the table
data_append.to_sql(table_name, conn, if_exists = 'append', index =False)
print('Data appended successfully')

Data appended successfully

In [23]:
# Query the table
query_statement=f"SELECT * FROM {table_name}"
query_output=pd.read_sql(query_statement,conn)
#print(query_statement)
print("Instructors List after update:\n\n")
print(query_output)

Instructors List after update:


     ID    FNAME      LNAME      CITY CCODE
0     1      Rav      Ahuja   TORONTO    CA
1     2     Raul      Chong   Markham    CA
2     3     Hima  Vasudevan   Chicago    US
3     4     John     Thomas  Illinois    US
4     5    Alice      James  Illinois    US
5     6    Steve      Wells  Illinois    US
6     7  Santosh      Kumar  Illinois    US
7     8    Ahmed    Hussain  Illinois    US
8     9    Nancy      Allen  Illinois    US
9    10     Mary     Thomas  Illinois    US
10   11  Bharath      Gupta  Illinois    US
11   12   Andrea      Jones  Illinois    US
12   13      Ann      Jacob  Illinois    US
13   14     Amit      Kumar  NewDelhi    IN
14  100     John        Doe     Paris    FR
15    1   Mosisa      Olana  New York    NY
16   21   Mosisa      Olana  New York    NY